turtle-bazon/secd-machine/platforms/esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_FREERTOS_HZ=1000
# Primary console on UART: the DWC2 USB device (CherryUSB) and the
# USB-Serial/JTAG console share GPIO19/20 and cannot run at the same time.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CherryUSB DWC2 device stack (managed component), console CDC + HID.
CONFIG_CHERRYUSB=y
CONFIG_CHERRYUSB_DEVICE=y
CONFIG_CHERRYUSB_DEVICE_DWC2_ESP=y
CONFIG_CHERRYUSB_DEVICE_CDC_ACM=y
CONFIG_CHERRYUSB_DEVICE_HID=y